#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/maxfrise/maxfrise-infra/runs/run-SeQ8WUg9UBiGwg4M

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.api_lambdas["initLease"].data.archive_file.source_code: Refreshing...
module.agencies_lambda.data.archive_file.agencies_source: Refreshing...
module.api_lambdas["getHouses"].data.archive_file.source_code: Refreshing...
module.api_lambdas["houseOverview"].data.archive_file.source_code: Refreshing...
module.api_lambdas["createHouse"].data.archive_file.source_code: Refreshing...
module.api_lambdas["paymentCollector"].data.archive_file.source_code: Refreshing...
module.api_lambdas["getHouses"].data.archive_file.source_code: Refresh complete after 0s [id=3cb83b0323d1ffbeb160f52a21fb516977766d5e]
module.api_lambdas["initLease"].data.archive_file.source_code: Refresh complete after 0s [id=66f8eb07d25c97e7b2c8980dc7d151728270897c]
module.api_lambdas["houseOverview"].data.archive_file.source_code: Refresh complete after 0s [id=e577589b24b8fbb044463c9d89b1b1122f330187]
module.agencies_lambda.data.archive_file.agencies_source: Refresh complete after 0s [id=b8e8dff93783493389ac68438bb9a05cf6abee9e]
module.api_lambdas["createHouse"].data.archive_file.source_code: Refresh complete after 0s [id=25b75e1a5a6cff6b9496ba7c6c10e468b9d0c1e4]
module.api_lambdas["paymentCollector"].data.archive_file.source_code: Refresh complete after 0s [id=bc2c03be875cc2f88f8a3ad35ee21dd7b18823c3]
module.maxfrise_api_v2.data.aws_acm_certificate.maxfrise_test: Refreshing...
module.api_lambdas["initLease"].aws_s3_object.source_s3_bucket: Refreshing state... [id=initLease_lambda.zip]
module.api_lambdas["getHouses"].aws_s3_object.source_s3_bucket: Refreshing state... [id=getHouses_lambda.zip]
module.api_lambdas["houseOverview"].aws_s3_object.source_s3_bucket: Refreshing state... [id=houseOverview_lambda.zip]
module.maxfrise_api_v2.data.aws_acm_certificate.maxfrise: Refreshing...
module.api_lambdas["createHouse"].aws_s3_object.source_s3_bucket: Refreshing state... [id=createHouse_lambda.zip]
module.iam_maxfrise_lambdas.aws_iam_role.iam_maxfrise_lambdas: Refreshing state... [id=iam_maxfrise_lambdas]
module.api_lambdas["paymentCollector"].aws_s3_object.source_s3_bucket: Refreshing state... [id=paymentCollector_lambda.zip]
module.dynamoDB_agencies_prod_table.aws_dynamodb_table.agencies_prod: Refreshing state... [id=agencies-prod-table]
module.dynamoDB_agencies_test_table.aws_dynamodb_table.agencies_test: Refreshing state... [id=agencies-test-table]
module.maxfrise_user_pool.aws_cognito_user_pool.users_pool: Refreshing state... [id=us-west-2_3oKP9s8K9]
module.agencies_lambda.aws_s3_object.agencies_s3_bucket: Refreshing state... [id=agencies_lambda.zip]
module.maxfrise_api_gateway.aws_api_gateway_rest_api.maxfrise_api: Refreshing state... [id=8hbmj9nmrj]
module.api_lambdas["getHouses"].aws_lambda_function.lambda_function: Refreshing state... [id=getHouses_TF]
module.api_lambdas["initLease"].aws_lambda_function.lambda_function: Refreshing state... [id=initLease_TF]
module.api_lambdas["createHouse"].aws_lambda_function.lambda_function: Refreshing state... [id=createHouse_TF]
module.api_lambdas["houseOverview"].aws_lambda_function.lambda_function: Refreshing state... [id=houseOverview_TF]
module.api_lambdas["paymentCollector"].aws_lambda_function.lambda_function: Refreshing state... [id=paymentCollector_TF]
module.agencies_lambda.aws_lambda_function.agencies_lambda: Refreshing state... [id=agencies_lambda]
module.maxfrise_user_pool.aws_cognito_user_pool_domain.domain: Refreshing state... [id=maxfrise]
module.maxfrise_api_v2.data.aws_acm_certificate.maxfrise: Refresh complete after 1s [id=arn:aws:acm:us-west-2:914036813947:certificate/48eb269b-4ebd-40d3-bf94-dded021baf25]
module.maxfrise_user_pool.aws_cognito_user_pool_client.client[0]: Refreshing state... [id=7akg4pgnuu8tss89ht74djv5lp]
module.maxfrise_api_v2.data.aws_acm_certificate.maxfrise_test: Refresh complete after 1s [id=arn:aws:acm:us-west-2:914036813947:certificate/56f07a0b-a2e0-46cc-b89b-e65f04d9f47c]
module.maxfrise_api_v2.aws_api_gateway_domain_name.production_v2_domain: Refreshing state... [id=apiv2.maxfrise.com]
module.maxfrise_api_v2.aws_api_gateway_domain_name.staging_v2_domain: Refreshing state... [id=staging.apiv2.maxfrise.com]
module.maxfrise_api_gateway.aws_api_gateway_resource.agencies_resource: Refreshing state... [id=udh18b]
module.maxfrise_api_gateway.aws_api_gateway_method.agencies_resource_method: Refreshing state... [id=agm-8hbmj9nmrj-udh18b-POST]
module.maxfrise_api_gateway.aws_lambda_permission.agencies_api_lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.maxfrise_api_v2.data.template_file.maxfrise_api_v2_spec: Refreshing...
module.maxfrise_api_v2.data.template_file.maxfrise_api_v2_spec: Refresh complete after 0s [id=2015721aa92e16a5b79f518607881598d1b09b12189a02aadae5eeea0b8bea18]
module.maxfrise_api_v2.aws_api_gateway_rest_api.api_v2: Refreshing state... [id=dhp09inpz4]
module.maxfrise_api_gateway.aws_api_gateway_integration.agencies_lambda_integration_request: Refreshing state... [id=agi-8hbmj9nmrj-udh18b-POST]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_test_deployment: Refreshing state... [id=x3fdqk]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_prod_deployment: Refreshing state... [id=uq9zi6]
module.maxfrise_api_v2.aws_api_gateway_deployment.prod_deployment: Refreshing state... [id=k1y6cv]
module.maxfrise_api_v2.aws_api_gateway_deployment.test_deployment: Refreshing state... [id=aiuq1w]
module.api_lambdas["createHouse"].aws_lambda_permission.lambda_api_gateway_permissions: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_lambdas["houseOverview"].aws_lambda_permission.lambda_api_gateway_permissions: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_lambdas["getHouses"].aws_lambda_permission.lambda_api_gateway_permissions: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_lambdas["initLease"].aws_lambda_permission.lambda_api_gateway_permissions: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_lambdas["paymentCollector"].aws_lambda_permission.lambda_api_gateway_permissions: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.maxfrise_api_gateway.aws_api_gateway_stage.prod: Refreshing state... [id=ags-8hbmj9nmrj-prod]
module.maxfrise_api_gateway.aws_api_gateway_stage.test: Refreshing state... [id=ags-8hbmj9nmrj-test]
module.maxfrise_api_v2.aws_api_gateway_stage.test_stage: Refreshing state... [id=ags-dhp09inpz4-test]
module.maxfrise_api_v2.aws_api_gateway_stage.prod_stage: Refreshing state... [id=ags-dhp09inpz4-prod]
module.maxfrise_api_v2.aws_api_gateway_base_path_mapping.staging_v2_domain: Refreshing state... [id=staging.apiv2.maxfrise.com/]
module.maxfrise_api_v2.aws_api_gateway_base_path_mapping.production_v2_domain: Refreshing state... [id=apiv2.maxfrise.com/]
module.maxfrise_api_v2.aws_api_gateway_domain_name.staging_v2_domain: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.maxfrise_user_pool.aws_cognito_user_pool.users_pool must be replaced
-/+ resource "aws_cognito_user_pool" "users_pool" {
      + alias_attributes           = [ # forces replacement
          + "email",
        ]
      ~ arn                        = "arn:aws:cognito-idp:us-west-2:914036813947:userpool/us-west-2_3oKP9s8K9" -> (known after apply)
      ~ creation_date              = "2023-07-09T22:47:50Z" -> (known after apply)
      + custom_domain              = (known after apply)
      ~ domain                     = "maxfrise" -> (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      ~ endpoint                   = "cognito-idp.us-west-2.amazonaws.com/us-west-2_3oKP9s8K9" -> (known after apply)
      ~ estimated_number_of_users  = 1 -> (known after apply)
      ~ id                         = "us-west-2_3oKP9s8K9" -> (known after apply)
      ~ last_modified_date         = "2023-07-09T22:47:51Z" -> (known after apply)
        name                       = "maxfrise_users"
      + sms_verification_message   = (known after apply)
        tags                       = {
            "Environment" = "production"
            "Owner"       = "maxfrise"
            "Terraform"   = "true"
        }
      - username_attributes        = [] -> null
        # (5 unchanged attributes hidden)

      ~ admin_create_user_config (known after apply)
      - admin_create_user_config {
          - allow_admin_create_user_only = false -> null
        }

      ~ password_policy (known after apply)
      - password_policy {
          - minimum_length                   = 8 -> null
          - require_lowercase                = true -> null
          - require_numbers                  = true -> null
          - require_symbols                  = true -> null
          - require_uppercase                = true -> null
          - temporary_password_validity_days = 7 -> null
        }

      ~ sms_configuration (known after apply)

      ~ verification_message_template (known after apply)
      - verification_message_template {
          - default_email_option  = "CONFIRM_WITH_CODE" -> null
            # (5 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.maxfrise_user_pool.aws_cognito_user_pool_client.client[0] must be replaced
-/+ resource "aws_cognito_user_pool_client" "client" {
      ~ client_secret                                 = (sensitive value)
      - enable_propagate_additional_user_context_data = false -> null
      ~ id                                            = "7akg4pgnuu8tss89ht74djv5lp" -> (known after apply)
      ~ logout_urls                                   = [] -> (known after apply)
        name                                          = "maxfrise_web_client"
      ~ user_pool_id                                  = "us-west-2_3oKP9s8K9" -> (known after apply) # forces replacement
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.maxfrise_user_pool.aws_cognito_user_pool_domain.domain must be replaced
-/+ resource "aws_cognito_user_pool_domain" "domain" {
      ~ aws_account_id                  = "914036813947" -> (known after apply)
      ~ cloudfront_distribution         = "dpp0gtxikpq3y.cloudfront.net" -> (known after apply)
      ~ cloudfront_distribution_arn     = "dpp0gtxikpq3y.cloudfront.net" -> (known after apply)
      ~ cloudfront_distribution_zone_id = "Z2FDTNDATAQYW2" -> (known after apply)
      ~ id                              = "maxfrise" -> (known after apply)
      ~ s3_bucket                       = "aws-cognito-prod-pdx-assets" -> (known after apply)
      ~ user_pool_id                    = "us-west-2_3oKP9s8K9" -> (known after apply) # forces replacement
      ~ version                         = "20230709224752" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @saudelog, Action: `pull_request`*